linux/ssh免登录.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-01-25 一 17:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="huihui" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. ssh密钥认证原理</a></li>
<li><a href="#orgheadline2">2. 使用公钥登录(免输入密码)</a></li>
<li><a href="#orgheadline3">3. 关于authorized<sub>keys文件</sub></a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> ssh密钥认证原理</h2>
<div class="outline-text-2" id="text-1">
<p>
SSH 之所以保证安全， 原因在于它采用了公钥加密。
整个ssh密码登录的过程如下
</p>
<ol class="org-ol">
<li>用户向远程主机发登录请求： ssh user@host。</li>
<li>远程主机收到用户的登录请求，把自己的公钥发送给用户。</li>
<li>用户使用这个公钥，将登录密码加密后， 发送回远程主机。</li>
<li>远程主机用自己的私钥，解密登录密码，如果密码正确，就同意用户登录。</li>
</ol>

<p>
在linux下如果你是第一次登录对方主机，系统会提示：
</p>
<blockquote>
<p>
The authenticity of host 'host (12.18.429.21)' can't be established.
RSA key fingerprint is 98:2e:d7:e0:de:9f:ac:67:28:c2:42:2d:37:16:58:4d.
Are you sure you want to continue connecting (yes/no)? 
</p>
</blockquote>

<p>
这段话的意思是,无法确认host主机的真实性，只知道它的 <b>密钥指纹</b> ，问你向继续连接吗？
</p>

<p>
所谓的 “密钥指纹”， 是指的是公钥长度较长（这里采用RSA算法，长达1024位），很难比对，所以对其进行MD5计算，将它变成一个128位的指纹。上例中是98:2e:d7:e0:de:9f:ac:67:28:c2:42:2d:37:16:58:4d，再进行比较，就容易多了。
</p>

<p>
很自然的一个问题就是，用户怎么知道远程主机的公钥指纹应该是多少？回答是没有好办法，远程主机必须在自己的网站上贴出公钥指纹，以便用户自行核对。
</p>

<p>
假定经过风险衡量以后，用户决定接受这个远程主机的公钥。
</p>
<blockquote>
<p>
Are you sure you want to continue connecting (yes/no)? yes
</p>
</blockquote>

<p>
系统会出现一句提示，表示host主机已经得到认可。
</p>
<blockquote>
<p>
Warning: Permanently added 'host,12.18.429.21' (RSA) to the list of known hosts.
</p>
</blockquote>

<p>
然后，会要求输入密码。
</p>
<blockquote>
<p>
Password: (enter password)
</p>
</blockquote>

<p>
如果密码正确，就可以登录了。
</p>

<p>
当远程主机的公钥被接受以后，它就会被保存在文件$HOME/.ssh/known<sub>hosts之中</sub>。下次再连接这台主机，系统就会认出它的公钥已经保存在本地了，从而跳过警告部分，直接提示输入密码。
</p>

<p>
每个SSH用户都有自己的known<sub>hosts文件</sub>，分别在自己的$HOME目录下，此外操作系统也有一个这样的文件，通常是/etc/ssh/ssh<sub>known</sub><sub>hosts</sub>，保存一些对所有用户都可信赖的远程主机的公钥。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 使用公钥登录(免输入密码)</h2>
<div class="outline-text-2" id="text-2">
<p>
使用密码登录，每次都必须输入密码，非常麻烦。好在SSH还提供了公钥登录，可以省去输入密码的步骤。
</p>

<p>
所谓"公钥登录"，原理很简单，就是用户将自己的公钥储存在远程主机上。登录的时候，
远程主机会向用户发送一段随机字符串，用户用自己的私钥加密后，再发回来。
远程主机用事先储存的公钥进行解密，如果成功，就证明用户是可信的，
直接允许登录shell，不再要求输入密码，这和之前的ssh账号密码也没有直接关系。
</p>

<p>
这种方法要求用户必须提供自己的公钥。如果没有现成的，可以直接用ssh-keygen生成一个：
</p>
<blockquote>
<p>
$ ssh-keygen
</p>
</blockquote>

<p>
运行上面的命令以后，系统会出现一系列提示，可以一路回车。
其中有一个问题是，要不要对私钥设置口令（passphrase），
如果担心私钥的安全，这里可以设置一个。
</p>

<p>
运行结束以后，在$HOME/.ssh/目录下，会新生成两个文件：id<sub>rsa.pub和id</sub><sub>rsa</sub>。
前者是你的公钥，后者是你的私钥。
</p>


<p>
这时再输入下面的命令，将公钥传送到远程主机host上面： 
</p>
<blockquote>
<p>
$ ssh-copy-id user@host
</p>
</blockquote>

<p>
好了，从此你再登录远程主机，就不需要输入密码了。
</p>

<p>
如果还是不行，就打开远程主机的/etc/ssh/sshd<sub>config这个文件</sub>，
检查下面几行前面"#"注释是否取掉。
</p>
<blockquote>
nil</blockquote>

<p>
然后，重启 <b>远程主机</b> 的ssh服务。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 关于authorized<sub>keys文件</sub></h2>
<div class="outline-text-2" id="text-3">
<p>
远程主机将用户的公钥，保存在登录后的用户主目录的$HOME/.ssh/authorized<sub>keys文件中</sub>。公钥就是一段字符串，只要把它追加在authorized<sub>keys文件的末尾就行了</sub>。
</p>

<p>
如果不使用上面的ssh-copy-id命令，改用下面的命令也可以：
</p>

<blockquote>
<p>
root@192.168.1.77's password:   &lt;&#x2013; 输入机器Server的root用户密码
id<sub>rsa.pub</sub>                                                              100%  218     0.2KB/s   00:00
</p>
</blockquote>

<p>
如果远程主机的authorized<sub>keys文件已经存在</sub>，也可以往里添加公钥：
先将公钥文件上传到远程主机中，
</p>

<blockquote>
<p>
#scp -P 2007 ~/.ssh/id<sub>rsa.pub</sub> root@192.168.1.91:/root/
</p>
</blockquote>

<p>
SSH到登陆到远程主机，将公钥追加到 authorized<sub>keys</sub> 文件中
</p>
<blockquote>
<p>
cat <i>root/id<sub>rsa.pub</sub> &gt;&gt; /root</i>.ssh/authorized<sub>keys</sub>
</p>
</blockquote>

<p>
或直接运行命令:
</p>
<blockquote>
<p>
cat ~/.ssh/id<sub>dsa.pub</sub>|ssh -p 22 root@192.168.1.91 `cat - &gt;&gt; ~/.ssh/authorized<sub>keys</sub>`
</p>
</blockquote>

<p>
写入authorized<sub>keys文件后</sub>，公钥登录的设置就完成了。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: huihui</p>
<p class="date">Created: 2016-01-25 一 17:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
